'''Музыкальный фрагмент был оцифрован и записан в виде файла без использования сжатия данных. 
Получившийся файл был передан в город А по каналу связи за 54 секунды. Затем тот же музыкальный фрагмент был оцифрован 
повторно с разрешением в 3 раза ниже и частотой дискретизации в 4 раза выше, чем в первый раз. 
Сжатие данных не производилось. Полученный файл был передан в город Б за 36 секунд. 
Во сколько раз пропускная способность канала в город Б больше пропускной способности канала в город А?'''

print (54*4/3/36)